---
kind: other
id: Properties.T:Autodesk.Revit.DB.CompoundStructure
source: html/aecafbfb-32a0-ef3d-64ec-6204808240c4.htm
---
# CompoundStructure Properties

Horizontal segments below or at the cutoff height have their distance to the wall bottom fixed, those above
 have their distance to the wall top fixed.